Autodesk.Revit.DB.AddinUtils.UnRegisterActiveAddin
Since:
2026

Autodesk.Revit.DB.AddinUtils.RegisterActiveAddin(System.Guid,System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.AddinUtils
A utility class containing helpers related to Addin.
Since:
2026